of222/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       49327;
    }
    walls
    {
        type            wall;
        nFaces          344;
        startFace       49407;
    }
    cylinder
    {
        type            wall;
        nFaces          378;
        startFace       49751;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       50129;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          49788;
        startFace       50249;
    }
)

// ************************************************************************* //
